# day06_01_pandas

In [1]:
import pandas as pd
import numpy as np

In [8]:
# series = R의 vector와 비슷한 자료 구조 pandas의 자료구조 중 하나
# 값 + 인덱스 형태

s = pd.Series([1,2,3,4])
s
s + 1

0    2
1    3
2    4
3    5
dtype: int64

In [9]:
#np.array([1,2,3,4])

In [11]:
#리스트로 정의하기
b = pd.Series(['a','b','c'])
b

0    a
1    b
2    c
dtype: object

In [15]:
#numpy 로 정의하기
c = np.arange(6)
pd.Series(c)

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [17]:
#dict 로 정의하기
d = {'a':1,'b':2,'c':3}
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [25]:
obj = pd.Series([1,2,3,4])
obj.values
obj.dtypes
#인덱스 확인하기
obj.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
#obj 의 인덱스를 a,b,c,d로 지정
obj.index = ['a','b','c','d']
obj

a    1
b    2
c    3
d    4
dtype: int64

In [29]:
obj2 = pd.Series([100,80,70], index = ['수학','국어','미술'])
obj2

수학    100
국어     80
미술     70
dtype: int64

In [36]:
obj2.sum()
obj2.max()
obj2.min()
obj2.mean()

83.33333333333333

In [39]:
#실습하기 obj2의 모든 값에 + 1
obj2 + 1

수학    101
국어     81
미술     71
dtype: int64

In [47]:
obj2[obj2 >= obj2.mean()]

수학    100
dtype: int64

In [51]:
obj2['과학'] = 90
obj2

수학    100
국어     80
미술     70
과학     90
dtype: int64

In [53]:
obj2['미술'] = 70
obj2

수학    100
국어     80
미술     70
과학     90
dtype: int64

In [57]:
#수학 점수 조회
obj2['수학']
obj2[1]

80

#데이터 삭제하기
del obj2['과학']
obj2

# Data Frame
*  R과 동일한 데이터 프레임
* 행과 열
* 쉽게 생각해서 엑셀의 형태

In [63]:
#리스트 정의하기
pd.DataFrame([1,2,3]) # 1차원 리스트, 열의 방향으로 값 생성

   0
0  1
1  2
2  3

In [65]:
#리스트 정의하기
pd.DataFrame([[1,2,3]]) # 2차원 리스트, 행의 방향으로 값 생성

   0  1  2
0  1  2  3

In [69]:
# 시리즈로 정의하기
s = pd.Series([1,2,3])
pd.DataFrame([s])

   0  1  2
0  1  2  3

In [71]:
# dict로 정의하기
b = {'name' : ['justin','james'], 'age': [13,23]}
df = pd.DataFrame(b)
df

     name  age
0  justin   13
1   james   23

In [72]:
df.sum()

name    justinjames
age              36
dtype: object

In [97]:
d = np.arange(1,13).reshape(3,4)
df = pd.DataFrame(d, columns =['a','b','c','d'])
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [85]:
#모양 확인
df.shape

(3, 4)

In [87]:
#길이 확인
df.shape

(3, 4)

In [95]:
#df의 컬럼 확인
# list(df.columns)
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [101]:
#프레임 연산
df.sum()
df.mean()
df.min()

a    1
b    2
c    3
d    4
dtype: int64

In [103]:
#실습하기 df의 각 컬럼의 min의 합계

df.min().sum()

10

### dataframe 데이터 조회하기

* loc = 라벨값 기반의 2차원 인덱싱
* iloc = 인덱스 기반의 2차원 인덱싱
* at = 라벨값 기반의 인덱싱(한개의 값만 검색)
* iat = 인덱스 기반이 인덱싱(한개의 값만 검색)

In [105]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [125]:
display(df.loc[:,:]) # 전체
display(df.loc[:,'b']) # b 열만
display(df.loc[1,:]) #1행만

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

0     2
1     6
2    10
Name: b, dtype: int64

a    5
b    6
c    7
d    8
Name: 1, dtype: int64

In [116]:
#df 에서 1행의 c열 값을 조회
df.loc[1,'c']

7

In [123]:
#df 에서 d열 총합 구하기
df['d'].sum()
df.loc[:,'d'].sum()

24

In [127]:
#df 에서 0과 2행의 a열과 d열을 조회

df.loc[[0,2],['a','d']]

   a   d
0  1   4
2  9  12

In [129]:
#df 에서 0과 2행의 a열과 c 열, d열을 조회
df.loc[[0,2],['a','c','d']]

   a   c   d
0  1   3   4
2  9  11  12

In [131]:
#b와 d열의 합계의 평균
df.loc[:,['b','d']].sum().mean()

21.0

In [134]:
a = {'name':['korea','bigdata','academy'],'age':[9,20,17]}
df2 = pd.DataFrame(a)
df2

      name  age
0    korea    9
1  bigdata   20
2  academy   17

In [146]:
#big data에 a열 조회
# df2.loc[:,'age']
# df2['age']
df2.age

0     9
1    20
2    17
Name: age, dtype: int64

In [148]:
#df2 age열에 모든 값 + 1
df2.age + 1

0    10
1    21
2    18
Name: age, dtype: int64

In [171]:
#df2 age열 10 이삼만 조회
df2[df2['age'] >= 10]
df2[df2.age >= 10]
df2.loc[df2.age >= 10,:]

      name  age
1  bigdata   20
2  academy   17

In [193]:
#df2의 name이 korea만 나오게
a = df2.loc[:,'name'] == 'korea'
df2.loc[a,:]

    name  age
0  korea    9

In [199]:
#df2 name 에서 e가 포함된 이름만 출력
e = df2.name.str.contains('e')
df2.loc[e,:]

      name  age
0    korea    9
2  academy   17

In [203]:
#df2의 age 평균 이상만 조회
a = df2.age >= df2.age.mean()
df2.loc[a,:]

      name  age
1  bigdata   20
2  academy   17

In [207]:
#df2에 money라는 열을 추가 값은 1000,2000,3000
# df2['money'] = [1000,2000,3000]
df2.money = [1000,2000,3000]
df2

      name  age  money
0    korea    9   1000
1  bigdata   20   2000
2  academy   17   3000

### iloc 순서를 나타내는 정수형태로 조회가능

In [211]:
#df 0번째 행의 1번째 열 출력
df.iloc[0,1]

2

In [213]:
#df의 1,2행 1,3열 출력
df.iloc[[1,2],[1,3]]

    b   d
1   6   8
2  10  12

## iloc 순서를 나타내는 정수형태로 조회가능

* 하나의 값을 조회하는 경우, 빠른 인덱싱 속도가 요구되는 경우에 사용

In [218]:
%timeit df.loc[1,'a']

7.27 µs ± 326 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [219]:
%timeit df.at[1,'a']

3.42 µs ± 111 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [221]:
%timeit df.iloc[1,1]

17.9 µs ± 942 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [223]:
%timeit df.iat[1,1]

12.6 µs ± 783 ns per loop (mean ± std. dev. of 7 runs, 100,000 loops each)

In [225]:
#df 0행 a 열의 값 100으로 수정
df.loc[0,'a'] = 100
df

     a   b   c   d
0  100   2   3   4
1    5   6   7   8
2    9  10  11  12

In [228]:
#df 0행 a,b 열의 값 100,101으로 수정
df.loc[0,['a','b']] = [100,101]
df

     a    b   c   d
0  100  101   3   4
1    5    6   7   8
2    9   10  11  12

In [235]:
#df 3행 추가 13,14,15,16
df.loc[3,:] = [13,14,15,16]
df

       a      b     c     d
0  100.0  101.0   3.0   4.0
1    5.0    6.0   7.0   8.0
2    9.0   10.0  11.0  12.0
3   13.0   14.0  15.0  16.0

In [236]:
#df 3행 추가 13,14,15,16
pd.DataFrame([[13,14,15,16]])

    0   1   2   3
0  13  14  15  16

In [253]:
#df 마지막행 추가 17,18,19,20 추가
##df.append([[17,18,19,20]])
a = pd.DataFrame([[17,18,19,20]],columns = ['a','b','c','d'])
df2 = pd.concat([df,a])
df.append(a)

/var/folders/_c/9n856b0n6398h4n7sqt73xph0000gn/T/ipykernel_39185/769268730.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(a)

       a      b     c     d
0  100.0  101.0   3.0   4.0
1    5.0    6.0   7.0   8.0
2    9.0   10.0  11.0  12.0
3   13.0   14.0  15.0  16.0
0   17.0   18.0  19.0  20.0

In [257]:
#df2 인덱스 조회
df2.index

Int64Index([0, 1, 2, 3, 0], dtype='int64')

In [262]:
#인덱스 초기화하기
df2.index = [5,6,7,8,9]
df2
df2.reset_index(drop = True)

       a      b     c     d
0  100.0  101.0   3.0   4.0
1    5.0    6.0   7.0   8.0
2    9.0   10.0  11.0  12.0
3   13.0   14.0  15.0  16.0
4   17.0   18.0  19.0  20.0

In [267]:
#초기화 된 인덱스 원본에 반영하기
df2.reset_index(drop = True, inplace = True)
df2

       a      b     c     d
0  100.0  101.0   3.0   4.0
1    5.0    6.0   7.0   8.0
2    9.0   10.0  11.0  12.0
3   13.0   14.0  15.0  16.0
4   17.0   18.0  19.0  20.0

In [269]:
#1행 삭제 조회

df2.drop(1)

       a      b     c     d
0  100.0  101.0   3.0   4.0
2    9.0   10.0  11.0  12.0
3   13.0   14.0  15.0  16.0
4   17.0   18.0  19.0  20.0

In [274]:
#a 열 삭제 조회
df2.drop('a',axis = 1)

       b     c     d
0  101.0   3.0   4.0
1    6.0   7.0   8.0
2   10.0  11.0  12.0
3   14.0  15.0  16.0
4   18.0  19.0  20.0

In [278]:
#df2에서 b,c 열 삭제 조회
df2.drop(['b','c'],axis = 1)

       a     d
0  100.0   4.0
1    5.0   8.0
2    9.0  12.0
3   13.0  16.0
4   17.0  20.0

In [295]:
#인덱스를 특정번호 이후부터 부여해야한다면?
np.arange(1,len(df)+1)
df.set_index(np.arange(1,len(df)+1))

       a      b     c     d
1  100.0  101.0   3.0   4.0
2    5.0    6.0   7.0   8.0
3    9.0   10.0  11.0  12.0
4   13.0   14.0  15.0  16.0

In [305]:
#df2에 e열을 추가하면서 one, two, three, one, two 추가히기
df2.e = ['one','two','three','one','two']
df2

       a      b     c     d      e
0  100.0  101.0   3.0   4.0    one
1    5.0    6.0   7.0   8.0    two
2    9.0   10.0  11.0  12.0  three
3   13.0   14.0  15.0  16.0    one
4   17.0   18.0  19.0  20.0    two

In [313]:
#df2의 e열의 값이 one인 데이터만 조회하기
df2.loc[:,'e'] == 'one'
df2[df2.loc[:,'e'] == 'one']
df2.loc[df2.loc[:,'e'] == 'one',:]

       a      b     c     d    e
0  100.0  101.0   3.0   4.0  one
3   13.0   14.0  15.0  16.0  one

In [331]:
 #df2의 e열 값이 one 혹은 two 데이터를 조회하기
a = df2.loc[:,'e'].isin(['one','two'])
df2.loc[a,:]

       a      b     c     d    e
0  100.0  101.0   3.0   4.0  one
1    5.0    6.0   7.0   8.0  two
3   13.0   14.0  15.0  16.0  one
4   17.0   18.0  19.0  20.0  two

In [358]:
#df2 f열을 추가하면서 e열의 데이터가 one,three인 데이터에만 1을 추가하기
a = df2.loc[:,'e'].isin(['one','three'])
#df2.loc[:,'f'] = 1
# df2.loc[:,'f'] = 1
df2.loc[a,'f'] = 1
df2

       a      b     c     d      e    f
0  100.0  101.0   3.0   4.0    one  1.0
1    5.0    6.0   7.0   8.0    two  NaN
2    9.0   10.0  11.0  12.0  three  1.0
3   13.0   14.0  15.0  16.0    one  1.0
4   17.0   18.0  19.0  20.0    two  NaN

In [363]:
#결측치를 제외하기 조회
df2.dropna()
df2.dropna(how = 'any') #1개라도 결측이 포함되어 있다면 조회 안함
df2.dropna(how = 'all') #행의 열 전체가 결측이면 조회안함

       a      b     c     d      e    f
0  100.0  101.0   3.0   4.0    one  1.0
1    5.0    6.0   7.0   8.0    two  NaN
2    9.0   10.0  11.0  12.0  three  1.0
3   13.0   14.0  15.0  16.0    one  1.0
4   17.0   18.0  19.0  20.0    two  NaN

In [369]:
#결측치 확인
df2.isna()
df2.isnull()

       a      b      c      d      e      f
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False   True

In [383]:
#각 열별로 결측치가 존재하는지 확인
df2.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of        a      b      c      d      e      f
0  False  False  False  False  False  False
1  False  False  False  False  False   True
2  False  False  False  False  False  False
3  False  False  False  False  False  False
4  False  False  False  False  False   True>

In [387]:
#전체 데이터에서 결측치의 갯수를 확인
df2.isna().sum().sum()

2

In [388]:
#결측치를 특정한 값으로 채우기
df2.fillna(5)

       a      b     c     d      e    f
0  100.0  101.0   3.0   4.0    one  1.0
1    5.0    6.0   7.0   8.0    two  5.0
2    9.0   10.0  11.0  12.0  three  1.0
3   13.0   14.0  15.0  16.0    one  1.0
4   17.0   18.0  19.0  20.0    two  5.0